[
    {
    "Unity工程師" :[
       {
        "name":"AncientWeapon",
        "Image":[
                 "./WorkIMG/AncientWeapon01.png",
                 "./WorkIMG/AncientWeapon02.png",
                 "./WorkIMG/AncientWeapon03.png"
                ],
        "introduction":"遊戲種類：2D 橫向動作遊戲<br>藉由鍵盤上的按鍵來控制角色的移動與攻擊並設法擊退迎來的魔物，攻擊與移動為同一按鍵，按下即可移動到魔物身上攻擊，因此角色會在畫面上的四條通道上來回戰鬥，每一關都有固定數量的魔物，當魔物被清除完後，就能通往下一關，左上角的魔物被清除完畢後就遊戲通關。<br>遊戲故事：<br>主角是一名靈器使，能操作寄宿在古代武器中的器靈。而他與他的器靈夥伴們在尋找古代武器的冒險旅途中遇到了突然出現的魔物遺跡-龍圖騰。從圖騰上的凹洞湧出大量的魔物，使得附近的村子造受到攻擊。為了守護這些無辜村民，主角討伐這些魔物。",
        "thinking" :"這次的遊戲製作是我第一次把程式碼具體的以我自己的想法變成一個遊戲，因為是邊學邊做的情況，幾乎只要有學到的技巧當天就會把它加入遊戲中，如果遇到還沒學到的技術則在網路上看別人提供的解決方式來解決，像是延遲發動、讀取其他程式的資料和子彈發射等等，真的學到了不少，在美術製作上，我也是參考了線上視頻的製作方式，蒐集資料依照自己的設計圖製作，不過在主角的繪製上花了不少時間，我個人是比較會畫怪獸，因為它的線條繪製較為簡單，但人物就比較麻煩了，首先是為了簡單我繪製了三頭身的人物，在點陣圖的動畫上又要有明顯的動作在調整上就花了不少時間，最後完成的作品其實說實在的還是有些小問題，但在遊戲的遊玩上並不影響，雖然是簡簡單單的遊戲但我卻感受到我學到了不少，也從中學到不少樂趣。 "
       },
       {
        "name":"HIDE & SEEK",
        "Image":[
                 "./WorkIMG/HIDE&SEEK01.png",
                 "./WorkIMG/HIDE&SEEK02.png",
                 "./WorkIMG/HIDE&SEEK03.png"
                ],
        "introduction":"遊戲種類：2D橫向卷軸解謎<br>遊戲介紹：<br>一邊逃跑躲藏和一邊解謎，搭配上詼諧有趣的奇怪劇情，以及誇張的角色動作，對解謎遊戲做出了讓他不那麼沉悶的變化，操作一個剛變成鬼的女上班族從死神的手上逃出生天，找出自己死亡的真相！<br>遊戲操作：<br>A D 鍵 移動  W 鍵跳躍和查詢可附身物件  S 鍵脫離附身 <br>加速移動系統 ----長按 A 或 D 鍵然後連點擊滑鼠左鍵可加快移動 <br>滑鼠左鍵功能 ----可關閉開啟的視窗(調查話框除外)與打開樓梯電燈 <br>滑鼠右鍵功能 ----用於調查玩家接觸過的物件，對話框翻頁，道具箱的物件回顧 <br>空白鍵----在門口可以切換房間 ",
        "thinking" :"我主要負責的是遊戲的程式製作，程式的製作其實沒有想像中的簡單，因為我們必須配合設計組的圖片來改變我們的程式，其中攝影 機的控制為了配合設計組設計的畫面做了不少的修改，在玩家的動 畫操作上也做了不少的修改。就以這次的案子而言我遇到了不少問 題，為了解決這些問題也在網路上找了不少方法解決，在解決完問 題時很有成就感，但多少還是有美中不足的部分，像是動畫切換的 部分，常會有來不及切換過去的情形，如果操作太快就會出問題， 讓我相當苦惱，也許在這種操作繁瑣的部分盡量必免寫在 update 中 或須是一種好方法，再來式如果又多個相同的程式需要個別被傳輸 資料時，用 FIND 尋找指定的物件內的程式式一個相當不錯的方法。 尤其是 Unity 宣告的可變物件可以在外面作設定相當方便，同時也 有助於減少程式檔的數量是相當方便。"
       },
       {
        "name":"宅怨",
        "Image":[
                 "./WorkIMG/宅怨01.png",
                 "./WorkIMG/宅怨02.png",
                 "./WorkIMG/宅怨03.png"
                ],
        "introduction":"遊戲平台：PC<br>遊戲類型：卡牌動作塔防遊戲<br>企劃緣起<br>由於我們對於遊戲創作深感興趣，基於學長姊往年都有利用放視大賞將自己的作品放上為由，我們認為或許也可以創作一款我們所構思的遊戲來參加比賽，剛好學期的專題學程有相關的製作進度以及展演需求，藉著這次機會便踏入了本企劃的製作當中。<br>開發動機<br>隨著時代更迭，社會的發展和生活方式的改變，再加上外來文化帶給我們的新鮮體驗，種種因素都讓我們逐漸遺淡忘屬於自己的文化，但時代的轉折並不都是壞處，由於電子產品的進步，遊戲現在已經逐漸融入我們的生活之中，因此我們希望能藉由遊戲與文化的結合，讓玩家能隨著遊戲的進程逐步了解傳統文化。",
        "thinking" :"我在本次的製作主要是負責程式的編寫，基本上在程式上的問題多少都有解決的辦法，但我感觸較深的還是在企劃製作的部份。在企劃製作時是全員一起製作的，沒有統一出一個主企劃所以使得整個作品在製作前期很容易受到外界評論影響，導致到最後還臨時更改題目讓整個工期變得很緊張。深深感受到主企劃的重要性，在製作後期更是走一步算一步，勉勉強強的才完成了部份的內容。而我自己也清楚還有很多不足的地方但也只能繼續下去。在製作上程式多少是有些瓶頸但也是多虧網路上的資源，有很多解決方案能處理所需的功能不過最重要的還是實際的工期完全不夠，無法說將作品完全完成，而且有不少新功能也在不斷增加，也正因為企劃的變動性大導致在遊戲性上變成了一堆有趣功能的聚合體，在遊戲的核心上則變得有些迷失。這些都是我們所面對的挑戰，我們應該重新去思考自己的作品的元素與主題以及對這個遊戲的想像，去好好想想自己的作品會變成甚麼樣子，不過最重要的還是做出自己滿意的作品。"
       },
       {
        "name":"魔方地下城",
        "Image":[
                 "./WorkIMG/魔方地下城01.png",
                 "./WorkIMG/魔方地下城02.png",
                 "./WorkIMG/魔方地下城03.png"
                ],
        "introduction":"遊戲平台：android<br>遊戲類型：3D 塔防<br><br>遊戲玩法：<br>玩家將操作人物面對一波又一波的敵人，而玩家需要保護身後的魔方不被破壞。玩家可以藉由擊倒敵人獲得金幣，利用金幣去活化圖騰柱或是強化武器讓你能更有效率的擊倒敵人。 ",
        "thinking" :"這是我第一次製作手機遊戲，說是手機遊戲但在操作上和一半遊戲製作差不了多少，不過製作的時間不長所以大部分的物件都是用免費素材，而玩家是利用課堂上製作的人物模型再利用線上綁骨架的系統來製作 3D 動畫，而 UI 的部分是自己畫的，算是我自己獨力完成的作品，格外的有成就感。雖然沒有說會讓人想一直玩這個遊戲但無聊時作為一個短時間的消遣還算是很不錯的。"
       },
       {
        "name":"機器人AI系所導覽",
        "Image":[
                 "./WorkIMG/機器人AI系所導覽01.png",
                 "./WorkIMG/機器人AI系所導覽02.png",
                 "./WorkIMG/機器人AI系所導覽03.png"
                ],
        "introduction":"創作動機：<br>藉由這次系主任想利用系辦所採購的 temi 機器人來設計一款方便大家使用的系統，加上我們對於其感到十分的有興趣，同時也有撰寫程式的經驗，因此進行此次的企劃。 <br>創作介紹：<br>利用 temi 內所具有的感應器來製作一套方便使用的導覽系統，其中包括系所資料、教室資訊、課程資訊、歷屆作品、以及互動式小遊戲等，此系統不僅可讓人更加簡易的操控，讓使用的用戶能以最為直觀的方式來搜索想要的資料，亦能與其互動，帶給人更加活潑有趣的使用體驗。",
        "thinking" :"這次的專題讓我接觸到 Android studio 製作以及 JAVA 語言的使用，一開始想說可以用 C#來寫，不過開始接觸後其實和 Unity 的感覺很像，只不過是改用 JAVA 來編寫。在製作上移動的部分還是得依靠內部已經寫好的程式來去獲取地圖前往地點。而我們主要的製作就是讓按鍵能切換畫面，連接影片進行播放藉由 string.xml 來儲存可變資料，之後只需修改這裡的資料就可以更新，圖片的部分就比較麻煩，現在還是寫在程式中。 <br>製作中主要遇到的問題還是影片播放，試了很多方法還是很難去使用YouTube的影片來做播放，只能用線上儲存空間將影片儲存然後藉由網路去讀取，不然直接存入影片會傳送太久，再來是用手勢控制圖像的功能需要用自訂義的方式來去製作，讓 imageview 去繼承我們打好的程式，不過還是得要注意Android 的版本，有些版本不支援而有些是權限的部分需要開通。<br>再來是之後會把按鍵的部分做修改，像是作品的按鍵可以用每一組的名稱當按鈕的名稱，還有就是在使用的頁面按鈕能改變顏色。再來是嘗試使用語音的部份，可以嘗試使用 Android Studio TTS 來達成語音播放，因為實際上使用廠商提供的程式其實感覺上有些侷限，能做的部份感覺被侷限住了而且感覺上有很多地方可以改善而且研究下來只有語音的部份才用到這個功能其實有些不方便，可以盡量去嘗試更多方法來改善程式。"
       },
       {
        "name":"Morning工作室",
        "Image":[
                 "./WorkIMG/Morning工作室01.png",
                 "./WorkIMG/Morning工作室02.png",
                 "./WorkIMG/Morning工作室03.png"
                ],
        "introduction":"遊戲平台：Android<br>遊戲類型：技能學習型<br><br>創作背景：<br>碩士創作專題主要目的用於學習職場相關英文互動，透過AR以及語音識別的方式增加互動效果以及真實感受，通過語音溝通的方式讓口語能力以及外語職場互動方式提升。<br>互動機制：<br>主要以語音互動為主。畫面中透過長按麥克風的方式啟用語音識別透過小助手互動的指引完成互動任務目標",
        "thinking" :"本專案主要是與研究室的夥伴共同創作，我主要是針對語音系統整合以及AR應用，並透過建立小助手系統來研究AR助理的易用性。在本次開發中面臨的問題就是語音識別的部分，由於成本上的關係找尋了許多方案，最後在GITHUB中找到替代方案，歲然識別效果不如預想，但也解決了最主要的問題，再來是AR互動以及ChatGPT的引用，本次專案在開發時有多次的討論，使用的平台也從MR到AR，眼鏡到手機，由於需要考量到眼鏡本身普及率不高，會影響易用性上的結果加上眼鏡數量不足用於課堂，才移到手機上。對於我個人而言在一次次的方案更改中都有學到各平台之間轉換的方式以及在不同平台上套件的更改與應用方式的不同。<br>系統上基本差不了多少但在不同平台能做到的事也不一樣，也在這一次的開發中理解到要在有限的條件下需要付出時間去撫平差距，以及盡自己可能去達成理想的目的，才能發現自己缺少了甚麼或忽略了甚麼。"
       },
       {
        "name":"CuteHunter",
        "Image":[
                 "./WorkIMG/CuteHunter01.png",
                 "./WorkIMG/CuteHunter02.png",
                 "./WorkIMG/CuteHunter03.png"
                ],
        "introduction":"遊戲平台：VR、PC<br>遊戲類型：VR動作類遊戲<br>遊戲概念：<br>捕捉可愛的魔物被抓到的他們會掙扎然後捕捉到的可以登錄圖冊<br>遊戲故事參考:怪獸與他的產地 捕捉逃跑怪獸<br>場景風格：場景為森林為中心，玩家可以移動尋找動物，並捕捉動物。武器以弓箭等進行變化，抓取物件、道具功能使用，將敵人抓入箱子中<br>遊戲機制簡述：<br>我們在遊戲中扮演獵人將在森林中搗亂的小怪獸捕捉起來，而玩家需要利用手上的武器將小怪獸捕捉起來。",
        "thinking" :"這次的作品是用我第一此使用VR系統製作，在作品的製作上有許多困難，第一次連接滑鼠與鍵盤之外的操控裝置，不過藉由VRTK的套件能達到相當好的連接，讓製作變得比較簡單加上VRTK內的有許多參考範例能更快讓我上手，不管是跳上障礙物，利用弓箭射擊敵人，抓取與投擲物件在範例中都有解決方案，再來就是如何活用這些技巧讓遊戲變有趣，不過也是因為第一次接觸我自己也不敢一下子就用一些很複雜的技術，擔心無法準時完成，提案也是修了不少次，最後還是感謝美術組的配合才能完成這次的作品。<br>在製作中較令我印象較深的還是弓箭的程式，藉由將箭碰撞到弓的位置來觸發程式將箭貼合設置點，利用兩控制器的距離控制動畫的播放的位置，這樣的操作是我第一次看到這樣的控制。在一些物件控制方面我利用UnityEvent來製作，這樣的控制比較直觀，按甚麼按鍵就觸發怎樣的效果在製作上也比較省時。<br>對於這次的製作雖說不算完美但我學到了很多，雖然我覺得VR遊戲其實不太需要太多複雜的操作，重點如果能放在與物件互動上會更有趣，讓物件有較多的回饋的話即使是只有拿取與丟擲物件都能有許多有趣的操作。"
       },
       {
        "name":"VR機械臂檢定系統",
        "Image":[
                 "./WorkIMG/VR機械臂檢定系統01.png",
                 "./WorkIMG/VR機械臂檢定系統02.png",
                 "./WorkIMG/VR機械臂檢定系統03.png"
                ],
        "introduction":"遊戲平台：VR<br>遊戲類型：技能學習型<br>創作背景：<br>碩士畢業前接的短期委託，主要是協助學生學習機械臂檢定編寫程式的能力，在系統上主要提供三個檢定題目，隨機讓學生抽選實作，雖有固定答案，但操作面板的程式編寫可以更具自身經驗去調整，增加編寫的彈性。並利用表單回傳學習紀錄給教師查看學習狀況。<br>互動機制：<br>主要以手部捕捉、按鍵互動和抓取為主。透過與互動板互動，最後讓機械臂操作完成題目目標，互動版的操作類似程式碼積木的組合方式，將程式塊和變數組合完成程式。",
        "thinking" :"本次的開發除了機械臂模型外，大多數的內容都由我負責，本次的內容主要還是透過OpenXR以及VR外掛來做整合。在這個短期專案中面臨的問題有虛實物件移動長度轉換問題、程式方塊間增減的關係與邏輯問題以及最後執行結果時如何解讀程式碼如何執行。基本的移動是沒有問題，但機械夾取移動與實際變化有一定的差異，在程式數值輸入後還需要有公式變量才能將正確的移動量呈現出來，再來是程式方塊的接合拉取，由於面板大小的限制也需要做一定的改變，更具不同段落程式得要去設計一個盡可能通用的開發環境，而方塊之間的關係變化也可能影響整個程式的運作，最後是程式出錯時要如何提醒學生如何改進或檢查程式內容。<br>這些開發需要有程式之間的邏輯觀念，以及除錯能力，沒有這些能力就很難針對錯誤情況給予建議，以及讓機械臂跟隨學生編組的程式變化。"
       }
    ],
    "前端工程師" :[
       {
        "name":"古墓殭屍",
        "Image":[
                 "./WorkIMG/古墓殭屍01.png",
                 "./WorkIMG/古墓殭屍02.png",
                 "./WorkIMG/古墓殭屍03.png"
                ],
        "introduction":"遊戲種類：2D平台式遊戲<br>創作動機：<br>在這次的課程中老師像我們介紹了一個製作遊戲的工具[GDevelop5]，運用這個工具能更簡單的製作出簡單的遊戲，而且在製作上更人性化也更簡單。運用上課學儀的技巧來製作出一個平台式遊戲。<br>作品介紹：<br>『古墓殭屍』是一個平台式的 2D 遊戲。作為為帝王興建陵墓的道士為地往選了一個風水寶地,並為陵寢做了各種擺設,就為讓國家國運昌榮,未想帝王想杜絕一切盜墓者·將全部餐與陵墓修建的人員全數陪葬,包括道士。不甘困於陵墓的道士為了逃出陵墓也為了向帝王復仇將自身化做殭屍向陵墓深處前進。",
        "thinking" :"這次的遊戲製作幾乎是一人完成的,從遊戲設計、畫圖到程式都是自己製作,雖然遊戲性上還是有些粗糙但卻有極高的成就感,也許是因為全由自己製作出來的關係感覺上還不錯。在製作上美術需要的時間大於程式撰寫的時間,但也因為程式簡化的關係以致程式無法靈活地去編寫,所有的操作過程會擠在一個頁面需要註解來標明這部份的程式是做甚麼的。算是這個工具較不方便的部分最後運用 Sever 與 nedb 資料庫儲存分數以及找出成績最好的紀錄,增加遊戲的挑戰性。不過整體上製作還是相當方便也很有趣。"
       },
       {
        "name":"AI互動網站_猜拳機",
        "Image":[
                 "./WorkIMG/猜拳機01.png",
                 "./WorkIMG/猜拳機02.png",
                 "./WorkIMG/猜拳機03.png"
                ],
        "introduction":"本專案為P5.js與TeachableMachine的簡易應用。透過攝影機抓取使用者的手勢，藉由TeachableMachine訓練圖像識別AI及時識別玩家手勢，根據不同的情況顯示互動的結果。較為麻煩的部份還是只要進入識別，就一定會有結果，這方面還需要根據信心值來調整結果，減少誤判。<br><br><a href='https://editor.p5js.org/chen58839/full/y0kr7XxaZ' target='_blank'>p5.js網頁</a>",
        "thinking" :"本專案是小組分組，我負責程式撰寫，雖然是簡單的課程作業，但在這過程中需要與負責美術的同學討論互動呈現的方式，如畫面中的小狗要如何動起來以及猜拳過程中數字旋轉變化的動畫，能用程式處理就盡量用程式處理，減輕網頁載圖的負擔，再來是訓練的AI的部份，本次為首次使用TeachableMachine訓練AI，在訓練上還需要加入一些不一樣的樣本，才能去減少誤判的的狀況，過多相似的樣本會影響AI的學習結果，導致訓練的AI出現挑食的狀況，需要連背景都相似才能識別。而這次的專案基本是課程內容的延伸，如何去用WebCam捕捉畫面以及識別畫面的課程。"
       },
       {
        "name":"Artifical Intelligence & ART",
        "Image":[
                 "./WorkIMG/aiART01.png",
                 "./WorkIMG/aiART02.png",
                 "./WorkIMG/aiART03.png"
                ],
        "introduction":"遊戲類型：技能學習型<br>創作背景：<br>碩士畢業前接的短期委託，主要是協助學生進行美術學習以及提供老師有一個交作業與打成績的互動平台，利用AI模型去識別並給予評分在確認完後會有一個小測驗，完成評分後會給予金幣與分數，供老師獎勵學生。<br>互動機制：<br>首先輸入學號登入，紀錄學號以及在登入後上傳圖檔，藉由AI模型識別圖檔的美術類型，在過關後會有相關美術類型的小測驗。系統上使用MySQL儲存資料，同時為教師端製作網頁去讀取學生資料。<br><br><a href='https://editor.p5js.org/chen58839/full/lEqkfIVj6' target='_blank'>p5.js測試版(圖像識別為主)</a>",
        "thinking" :"我在本專案中擔任程式開發員，美術圖片由專案負責老師提供，本網站主要透過Node.js傳輸與儲存資料到MySQL資料庫中，並將圖像存到伺服器的本地資料夾，本次用到了P5.js和teachable machine將圖像識別應用到本網站中，藉由信心值來給於評分，後續的互動主要還是藉由javascript和HTML來去達成網頁的互動。在這次的製作中，基本將網頁相關程式都使用了一遍，而最重要的是圖像問題，如果圖檔過大在壤速差的地方會影響使用者的感受，更不用說使用動圖(.gif)，如果不能配合創作呈現的話反而本末倒置，所以需要減少網站圖像讀取的時間就需要將圖像輕量化，壓在2M上下，才能讓網站的回饋更及時，本次的開發主要把大學期間學到的技能在一次複習，主要是比較少有網站開發的機會，而在這次的短期委託中，也拾回了不少之前學到的內容和資料庫的整合。"
       },
       {
        "name":"UI/UX練習_中科吃甚麼",
        "Image":[
                 "./WorkIMG/中科吃甚麼01.png",
                 "./WorkIMG/中科吃甚麼02.png",
                 "./WorkIMG/中科吃甚麼03.png"
                ],
        "introduction":"本專案為UI/UX設計課程的課堂作業，以中科大學生要找午餐為題，設計找午餐的app介面互動模型，透過分析persona的需求，再用Marvel來建立互動粗模。課程目標在分析顧客需求，如本次的分析中以經濟壓力為主，特別放大預算輸入的部分，讓顧客搜尋範圍縮小，在排列搜尋結果的部分會以價格排序為預設值排序方式，在伸縮畫面中也以優惠推薦為主，讓使用者能在第一時間得知哪裡有優惠項目。<br><br><a href='https://docs.google.com/presentation/d/1pCnhjxFIPUe4YssMiCuVq1JPdf114aI4/edit?usp=sharing&ouid=103223473139964553385&rtpof=true&sd=true' target='_blank'>PPT連結</a>",
        "thinking" :"本專案還是簡單的分析與建立，實際還需要考慮更全面的內容，作為課堂簡易的練習作業讓我學習如何分析persona，來去為顧客量身訂做所需的內容，後續也需考量使用者的app使用習慣以及年齡層的使用分布，來去微調使用者互動的部分。"
       },
       {
        "name":"商業介面修改練習_以發票怪獸為例",
        "Image":[
                 "./WorkIMG/修改案01.png",
                 "./WorkIMG/修改案02.png",
                 "./WorkIMG/修改案03.png"
                ],
        "introduction":"本專案是商業界面修改的課程作業，從分析修改對象到分析競爭對手以及Persona，最後分析User story 將修改需求更進一步的提出，針對問題建立修改方案，如：新的互動流程圖，新的互動模型等，建立粗模原型後於課堂上給同學試用，並蒐集修改意見，根據蒐集的結果分析完後討論分析的結果。<br><br><a href='https://docs.google.com/presentation/d/1jys0vn3aDSq1qUAT4T5-7tDD8DSTaiT-/edit?usp=sharing&ouid=103223473139964553385&rtpof=true&sd=true' target='_blank'>PPT連結</a>",
        "thinking" :"本次的商業專案修改沒有顯著的正面回應，但在這次的實作中能看到，發票怪獸相較於其他競爭對手而言，蒐集怪獸與怪獸互動是吸引人的遊戲體驗，因此在本次的修改中加強與怪獸互動的部份，以及透過與怪獸互動的方式切換頁面來解決畫面按鈕繁雜的問題，讓怪獸互動更吸引人，而不是一直透過增加怪獸來增加使用者。<br>修正時常見的問題還是長按與點按的互動模式不夠直覺，在互動上需要調整與更改，較正面的部份是與怪獸互動獲取怪獸幣，增加互動確實是正面的，但如何互動也是要認真思考的課題。"
       }
    ]
}    
]
